EDT/УТ/src/Documents/ГрафикРаботыСотрудников/ГрафикРаботыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГрафикРаботыСотрудников</name>
  <registerRecords>InformationRegister.ПланируемыйГрафикРаботыСотрудников</registerRecords>
  <registerRecords>InformationRegister.зпУчетЧасов</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.зпВидыЗанятости</types>
    </type>
  </attributes>
  <tabularSections>
    <name>График</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОтработанногоВремени</name>
      <type>
        <types>CatalogRef.КлассификаторИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>РольСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УчетПоЧасовойОплаты</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>РольСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасовОтработано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасовПереработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставЭкипажа</name>
      <type>
        <types>EnumRef.зпСоставЭкипажа</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>DocumentRef.Рейс</types>
      </type>
    </attributes>
    <attributes>
      <name>РольРейса</name>
      <type>
        <types>CatalogRef.РолиТранспорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/ПланируемыйГрафикРаботыСотрудников/ПланируемыйГрафикРаботыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланируемыйГрафикРаботыСотрудников</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидОтработанногоВремени</name>
    <type>
      <types>CatalogRef.КлассификаторИспользованияРабочегоВремени</types>
    </type>
  </resources>
  <resources>
    <name>РольСотрудника</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </resources>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.зпВидыЗанятости</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/зпУчетЧасов/зпУчетЧасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>зпУчетЧасов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РольСотрудника</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>ЧасовОтработано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧасовПереработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СоставЭкипажа</name>
    <type>
      <types>EnumRef.зпСоставЭкипажа</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьСотрудника</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </resources>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.зпВидыЗанятости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/ГрафикРаботыСотрудников/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	//Геннадий #3395 08.07.2020 ->
	Если Не ЗначениеЗаполнено(ВидЗанятости) Тогда 
		Сообщить("Не заполнен вид занятости! Документ не проведен!"); 
		Возврат; 		
	КонецЕсли;
	
	//проверим, есть ли документ с таким же ВидомЗанятости, Подразделением, ТерминаломДоставки и месяцем
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикРаботыСотрудников.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ГрафикРаботыСотрудников КАК ГрафикРаботыСотрудников
		|ГДЕ
		|	ГрафикРаботыСотрудников.Период = &Период
		|	И ГрафикРаботыСотрудников.Терминал = &Терминал
		|	И ГрафикРаботыСотрудников.ВидЗанятости = &ВидЗанятости
		|	И ГрафикРаботыСотрудников.Подразделение = &Подразделение
		|	И ГрафикРаботыСотрудников.Проведен";
	
	Запрос.УстановитьПараметр("ВидЗанятости", ВидЗанятости);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Терминал", Терминал);
	
	//РезультатЗапросаТЗ = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса = Запрос.Выполнить();
	
	//Если РезультатЗапросаТЗ.Количество() > 1 Тогда
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("Внимание, документ не проведен!!! Для данного Терминала, Подразделения, Периода уже существует документ с основным видом занятости! Измените ""Вид занятости"" и повторите попытку!"); 
		Возврат; 		
		
	КонецЕсли;
	//Геннадий #3395 08.07.2020 <-
	
	//CeHbKA 01.07.2021
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокТЧ.ФизЛицо КАК ФизЛицо,
		|	ДокТЧ.Дата КАК Дата,
		|	ДокТЧ.РольСотрудника КАК РольСотрудника,
		|	ДокТЧ.ВидОтработанногоВремени КАК ВидОтработанногоВремени
		|ПОМЕСТИТЬ ДокТЧ
		|ИЗ
		|	&ДокТЧ КАК ДокТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧ.ФизЛицо КАК ФизЛицо,
		|	ДокТЧ.Дата КАК Дата,
		|	ДокТЧ.ВидОтработанногоВремени КАК ВидОтработанногоВремени,
		|	ВЫБОР
		|		КОГДА ПланируемыйГрафикРаботыСотрудников.ВидОтработанногоВремени ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Дубликат,
		|	ЕСТЬNULL(ПланируемыйГрафикРаботыСотрудников.Регистратор, ЗНАЧЕНИЕ(Документ.ГрафикРаботыСотрудников.ПустаяСсылка)) КАК Регистратор,
		|	ДокТЧ.РольСотрудника КАК РольСотрудника
		|ПОМЕСТИТЬ ВТ_1
		|ИЗ
		|	ДокТЧ КАК ДокТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланируемыйГрафикРаботыСотрудников КАК ПланируемыйГрафикРаботыСотрудников
		|		ПО ДокТЧ.ФизЛицо = ПланируемыйГрафикРаботыСотрудников.ФизЛицо
		|			И ДокТЧ.Дата = ПланируемыйГрафикРаботыСотрудников.Дата
		|			И ДокТЧ.РольСотрудника = ПланируемыйГрафикРаботыСотрудников.РольСотрудника
		|			И (ПланируемыйГрафикРаботыСотрудников.Регистратор <> &ДокументРегистратор)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_1.ФизЛицо КАК ФизЛицо,
		|	ВТ_1.Дата КАК Дата,
		|	ВТ_1.ВидОтработанногоВремени КАК ВидОтработанногоВремени,
		|	ВТ_1.Дубликат КАК Дубликат,
		|	ВТ_1.Регистратор КАК Регистратор,
		|	ВТ_1.РольСотрудника КАК РольСотрудника
		|ИЗ
		|	ВТ_1 КАК ВТ_1
		|ГДЕ
		|	ВТ_1.Дубликат = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДокТЧ", График.Выгрузить());
	Запрос.УстановитьПараметр("ДокументРегистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("Проведение невозможно! По сотруднику "+ВыборкаДетальныеЗаписи.ФизЛицо+" уже существует запись с ролью "+ВыборкаДетальныеЗаписи.РольСотрудника+" на дату "+ВыборкаДетальныеЗаписи.Дата+" по документу "+ВыборкаДетальныеЗаписи.Регистратор);
		Отказ = Истина;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли; 
	//CeHbKA 01.07.2021
	
	// регистр ПланируемыйГрафикРаботыСотрудников
	Движения.ПланируемыйГрафикРаботыСотрудников.Записывать = Истина;
	Движения.ПланируемыйГрафикРаботыСотрудников.Очистить();
	Для Каждого ТекСтрокаГрафик Из График Цикл
		Движение = Движения.ПланируемыйГрафикРаботыСотрудников.Добавить();
		Движение.Период 		= Дата;
		Движение.Терминал 		= Терминал;
		Движение.ФизЛицо 		= ТекСтрокаГрафик.ФизЛицо;
		Движение.Дата			= ТекСтрокаГрафик.Дата;
		Движение.ВидОтработанногоВремени = ТекСтрокаГрафик.ВидОтработанногоВремени;
		Движение.РольСотрудника = ТекСтрокаГрафик.РольСотрудника;
		//Геннадий #3395 08.07.2020 ->
		Движение.ВидЗанятости 	= ВидЗанятости;
		//Геннадий #3395 08.07.2020 <-
	КонецЦикла;

	//Геннадий #3395 27.01.2021 ->
	Движения.зпУчетЧасов.Записывать = Истина;
	Движения.зпУчетЧасов.Очистить();
	Для Каждого СтрокаТЧ Из УчетПоЧасовойОплаты Цикл
		Движение = Движения.зпУчетЧасов.Добавить();
		Движение.Период 		= Дата;
		Движение.Терминал		= Терминал;
		Движение.ВидЗанятости 	= ВидЗанятости;
		
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТЧ);
	КонецЦикла;
	//Геннадий #3395 27.01.2021 <-
	
КонецПроцедуры
